Revit 2027 API
OpenOptions.OpenForeignOption Property
 An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OpenForeignOption OpenForeignOption { get; set; }
Public Property OpenForeignOption As OpenForeignOption
	Get
	Set
public:
property OpenForeignOption OpenForeignOption {
	OpenForeignOption get ();
	void set (OpenForeignOption value);
}
member OpenForeignOption : OpenForeignOption with get, set
Property Value
OpenForeignOption
 The default value is OpenForeignOption.Open.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OpenOptions Class
Autodesk.Revit.DB Namespace